module DefCombo where

def1 :: [[String]]
def1 = [
          []
        , []
        , []
        , [
            "Мужской"
          , "Женский"
          ]
        , []
        , []
        , []
        , [
            "Городская"
          , "Сельская"
          ]
        , [
            "Состоял в зарегистрированном браке"
          , "Не состоял"
          , "Неизвестно"
          ]
        , [
            "Профессиональное: высшее"
          , "Профессиональное: неполное высшее"
          , "Профессиональное: среднее"
          , "Профессиональное: начальное"
          , "Общее: среднее (полное)"
          , "Общее: основное"
          , "Общее: начальное"
          , "Не имеет начального образования"
          , "Неизвестно"
          ]
        , [
            "Руководители и специалисты высшего уровня квалификации"
          , "Прочие специалисты"
          , "Квалифицированные рабочие"
          , "Неквалифицированные рабочие"
          , "Занятые на военной службе"
          , "Пенсионеры"
          , "Студенты и учащиеся"
          , "Работавшие в личном подсобном хозяйстве"
          , "Безработные"
          , "Прочие"
          ]
        , []
        ]
