module Labels where

labels1 :: [String]
labels1 = [
          "0. № протокола"
        , "1. Дата протокола"
        , "2. Медицинская карта №"
        , "3. Фамилия, имя, отчество"
        , "4. Медицинская организация"
        , "5 Отделение"
        , "6. Пол"
        , "7. Дата рождения"
        , "8. Дата смерти"
        , "9. Место жительства"
        , "10. Местность"
        , "11. Семейное положение"
        , "12. Образование"
        , "13. Занятость"
        , "14. Дата поступления"
        ]
