module Text where

header1 :: String
header1 = "ПРОТОКОЛ\\line патологоанатомического вскрытия № "

text1 :: [String]
text1 = [
          "1. Наименование медицинской организации и отделения, в котором наблюдался и умер пациент: "
        , "2. Медицинская карта стационарного пациента № "
        , "3. Фамилия, имя, отчество умершего: "
        , "4. Пол: "
        , "5. Дата рождения: "
        , "6. Дата смерти: "
        , "7. Место жительства умершего: "
        , "8. Местность: "
        , "9. Семейное положение: "
        , "10. Образование: "
        , "11. Занятость: "
        , "12. Дата поступления в медицинскую организацию, в которой наблюдался и умер пациент: "
        , "13. Доставлен в медицинскую организацию, в которой наблюдался и умер пациент через "
        , "14. Фамилия, имя, отчество лечащего врача: "
        , "15. Лечащий врач (заведующий отделением) присутствовал на патологоанатомическом вскрытии "
        , "16. Дата проведения патологоанатомического вскрытия: "
        , "17. Основные клинические данные: "
        , "18. Заключительный клинический диагноз:\\line"
        , "Основное заболевание: "
        , "Осложнения основного заболевания: "
        , "Сопутствующие заболевания: "
        ]

header2 :: String
header2 = "{\\ulПАТОЛОГОАНАТОМИЧЕСКОЕ ВСКРЫТИЕ}"

text2 :: [String]
text2 = [
          "19. Наружный осмотр тела:\\line"
        , "20. Брюшная полость.\\line"
        , "21. Грудная полость.\\line"
        , "22. Полость черепа.\\line"
        , "5. Дата рождения:\\line"
        , "6. Дата смерти:\\line"
        , "7. Место жительства умершего:\\line"
        , "8. Местность:\\line"
        , "9. Семейное положение:\\line"
        , "10. Образование:\\line"
        , "11. Занятость:\\line"
        , "12. Дата поступления в медицинскую организацию, в которой наблюдался и умер пациент:\\line"
        , "13. Доставлен в медицинскую организацию, в которой наблюдался и умер пациент через\\line"
        , "14. Фамилия, имя, отчество лечащего врача:\\line"
        , "15. Лечащий врач (заведующий отделением) присутствовал на патологоанатомическом вскрытии\\line"
        , "16. Дата проведения патологоанатомического вскрытия:\\line"
        , "17. Основные клинические данные:\\line"
        , "18. Заключительный клинический диагноз:\\line"
        , "Основное заболевание:\\line"
        , "Осложнения основного заболевания:\\line"
        , "Сопутствующие заболевания:\\line"
        ]
