module Text where

text1 = [
          "1. Наименование медицинской организации и отделения, в котором наблюдался и умер пациент: "
        , "2. Медицинская карта стационарного пациента № "
        , "3. Фамилия, имя, отчество умершего: "
        , "4. Пол: "
        , "5. Дата рождения: "
        , "6. Дата смерти: "
        , "7. Место жительства умершего: "
        , "8. Местность: "
        , "9. Семейное положение: "
        , "10. Образование: "
        , "11. Занятость: "
        , "12. Дата поступления в медицинскую организацию, в которой наблюдался и умер пациент: "
        ]
